{
  "movies": [
    {
      "id": "1a2b3c4d-1111-2222-3333-abcdef123456",
      "name": "Начало",
      "url": "assets/images/start.jpg",
      "description": "Кобб – талантливый вор, лучший из лучших в опасном искусстве извлечения: он крадет ценные секреты из глубин подсознания во время сна, когда человеческий разум наиболее уязвим. Редкие способности Кобба сделали его ценным игроком в привычном к предательству мире промышленного шпионажа, но они же превратили его в извечного беглеца и лишили всего, что он когда-либо любил.\n\nИ вот у Кобба появляется шанс исправить ошибки. Его последнее дело может вернуть все назад, но для этого ему нужно совершить невозможное – инициацию. Вместо идеальной кражи Кобб и его команда спецов должны будут провернуть обратное. Теперь их задача – не украсть идею, а внедрить ее. Если у них получится, это и станет идеальным преступлением.\n\nНо никакое планирование или мастерство не могут подготовить команду к встрече с опасным противником, который, кажется, предугадывает каждый их ход. Врагом, увидеть которого мог бы лишь Кобб.",
      "tags": [
        "Фантастика",
        "Триллер",
        "Драма"
      ],
      "year": 2010,
      "rating": 8.7,
      "isError": true
    },
    {
      "id": "2b3c4d5e-4444-5555-6666-fedcba654321",
      "name": "Гладиатор",
      "url": "assets/images/gladiator.jpg",
      "description": "Римская империя. Бесстрашного и благородного генерала Максимуса боготворят солдаты, а старый император Марк Аврелий безгранично доверяет ему и относится как к сыну. Однако опытный воин, готовый сразиться с любым противником в честном бою, оказывается бессильным перед коварными придворными интригами. Коммод, сын Марка Аврелия, убивает отца, который планировал сделать преемником не его, а Максимуса, и захватывает власть. Решив избавиться от опасного соперника, который к тому же отказывается присягнуть ему на верность, Коммод отдаёт приказ убить Максимуса и всю его семью. Чудом выжив, но не сумев спасти близких, Максимус попадает в плен к работорговцу, который продаёт его организатору гладиаторских боёв Проксимо. Так легендарный полководец становится гладиатором. Но вскоре ему представится шанс встретиться со своим смертельным врагом лицом к лицу.",
      "tags": [
        "История",
        "Боевик",
        "Драма"
      ],
      "year": 2000,
      "rating": 7.9
    },
    {
      "id": "3c4d5e6f-7777-8888-9999-123456abcdef",
      "name": "Матрица",
      "url": "assets/images/matrix.jpg",
      "description": "Жизнь Томаса Андерсона разделена на две части: днём он — самый обычный офисный работник, получающий нагоняи от начальства, а ночью превращается в хакера по имени Нео, и нет места в сети, куда он бы не смог проникнуть. Но однажды всё меняется. Томас узнаёт ужасающую правду о реальности.",
      "tags": [
        "Фантастика",
        "Боевик",
        "Киберпанк"
      ],
      "year": 1999,
      "rating": 9.0
    },
    {
      "id": "5e6f7g80-bbbb-cccc-dddd-abcdefabcdef",
      "name": "Тёмный рыцарь",
      "url": "assets/images/dark_knight.jpg",
      "description": "Бэтмен поднимает ставки в войне с криминалом. С помощью лейтенанта Джима Гордона и прокурора Харви Дента он намерен очистить улицы Готэма от преступности. Сотрудничество оказывается эффективным, но скоро они обнаружат себя посреди хаоса, развязанного восходящим криминальным гением, известным напуганным горожанам под именем Джокер.",
      "tags": [
        "Боевик",
        "Криминал",
        "Драма"
      ],
      "year": 2008,
      "rating": 8.5
    },
    {
      "id": "6f7g8h90-cccc-dddd-eeee-abcdefabcdef",
      "name": "Крестный отец",
      "url": "assets/images/godfather.jpg",
      "description": "Криминальная сага, повествующая о нью-йоркской сицилийской мафиозной семье Корлеоне. Фильм охватывает период 1945-1955 годов.\n\nГлава семьи, Дон Вито Корлеоне, выдаёт замуж свою дочь. В это время со Второй мировой войны возвращается его любимый сын Майкл. Майкл, герой войны, гордость семьи, не выражает желания заняться жестоким семейным бизнесом. Дон Корлеоне ведёт дела по старым правилам, но наступают иные времена, и появляются люди, желающие изменить сложившиеся порядки. На Дона Корлеоне совершается покушение.",
      "tags": [
        "Криминал",
        "Драма"
      ],
      "year": 1972,
      "rating": 8.7
    },
    {
      "id": "7g8h9i01-dddd-eeee-ffff-abcdefabcdef",
      "name": "Список Шиндлера",
      "url": "assets/images/schindlers_list.jpg",
      "description": "Фильм рассказывает реальную историю загадочного Оскара Шиндлера, члена нацистской партии, преуспевающего фабриканта, спасшего во время Второй мировой войны почти 1200 евреев.",
      "tags": [
        "Драма",
        "История"
      ],
      "year": 1993,
      "rating": 7.8
    },
    {
      "id": "8h9i0j12-eeee-ffff-gggg-abcdefabcdef",
      "name": "Властелин колец: Братство кольца",
      "url": "assets/images/lord_of_the_rings.jpg",
      "description": "казания о Средиземье — это хроника Великой войны за Кольцо, длившейся не одну тысячу лет. Тот, кто владел Кольцом, получал неограниченную власть, но был обязан служить злу.\n\nТихая деревня, где живут хоббиты. Придя на 111-й день рождения к своему старому другу Бильбо Бэггинсу, волшебник Гэндальф начинает вести разговор о кольце, которое Бильбо нашел много лет назад. Это кольцо принадлежало когда-то темному властителю Средиземья Саурону, и оно дает большую власть своему обладателю. Теперь Саурон хочет вернуть себе власть над Средиземьем. Бильбо отдает Кольцо племяннику Фродо, чтобы тот отнёс его к Роковой Горе и уничтожил.",
      "tags": [
        "Фэнтези",
        "Приключения"
      ],
      "year": 2001,
      "rating": 8.6
    },
    {
      "id": "9i0j1k23-ffff-gggg-hhhh-abcdefabcdef",
      "name": "Бойцовский клуб",
      "url": "assets/images/fight_club.jpg",
      "description": "Сотрудник страховой компании страдает хронической бессонницей и отчаянно пытается вырваться из мучительно скучной жизни. Однажды в очередной командировке он встречает некоего Тайлера Дёрдена — харизматического торговца мылом с извращенной философией. Тайлер уверен, что самосовершенствование — удел слабых, а единственное, ради чего стоит жить, — саморазрушение.\n\nПроходит немного времени, и вот уже новые друзья лупят друг друга почем зря на стоянке перед баром, и очищающий мордобой доставляет им высшее блаженство. Приобщая других мужчин к простым радостям физической жестокости, они основывают тайный Бойцовский клуб, который начинает пользоваться невероятной популярностью.",
      "tags": [
        "Драма",
        "Триллер"
      ],
      "year": 1999,
      "rating": 8.7
    },
    {
      "id": "1k2l3m45-hhhh-iiii-jjjj-abcdefabcdef",
      "name": "Интерстеллар",
      "url": "assets/images/interstellar.jpg",
      "description": "Когда засуха, пыльные бури и вымирание растений приводят человечество к продовольственному кризису, коллектив исследователей и учёных отправляется сквозь червоточину (которая предположительно соединяет области пространства-времени через большое расстояние) в путешествие, чтобы превзойти прежние ограничения для космических путешествий человека и найти планету с подходящими для человечества условиями.",
      "tags": [
        "Фантастика",
        "Драма"
      ],
      "year": 2014,
      "rating": 8.0
    },
    {
      "id": "6p7q8r90-mmmm-nnnn-oooo-abcdefabcdef",
      "name": "Последний ронин (2024)",
      "url": "assets/images/shining.jpg",
      "description": "(Не)далекое будущее. В результате изменений климата, приведших к глобальной ядерной войне, цивилизация практически уничтожена: земли выжжены, города разрушены. Техника не работает, бензин давно потерял свои свойства. Главная валюта в этом мире — два патрона: 9 и 7,62 мм от АК-47.\n\nПреследуемый призраками прошлого одинокий путник Ронин странствует по пустошам в поисках убийцы своего отца, годами создавая карту континента. На каждом шагу его подстерегают охотники за головами и бандиты. Но однажды судьба сводит Ронина со своенравной девочкой-подростком Марией, которая обещает ему наивысшую плату, если он доведет ее до места, где она родилась.",
      "tags": [
        "Фантастика",
        "Приключения"
      ],
      "year": 2024,
      "rating": 5.7
    },
    {
      "id": "7q8r9s01-nnnn-oooo-pppp-abcdefabcdef",
      "name": "Воин",
      "url": "assets/images/warrior.jpg",
      "description": "Фильм рассказывает драматическую историю двух братьев, профессиональных спортсменов по боям ММА. Это картина о долге и жизненных ценностях, показанных сквозь призму жизни братьев и их отца – крепких и гордых людей, фильм о семье, об обидах, которые мы носим в себе десятилетиями, о боли, которую мы причиняем подчас бездумно, и о прощении, которому всегда должно найтись место в наших сердцах.",
      "tags": [
        "Драма",
        "Спорт"
      ],
      "year": 2015,
      "rating": 2.9
    },
    {
      "id": "8r9s0t12-oooo-pppp-qqqq-abcdefabcdef",
      "name": "Спираль",
      "url": "assets/images/spiral.jpg",
      "description": "Главный герой истории – Алексей, талантливый программист из Новосибирска, приезжает в Москву и становится членом закрытого полулегального элитного клуба под названием «Спираль». Как новичку ему крупно везет, и он выигрывает одну экстремальную игру клуба за другой, получая сумасшедшие гонорары. В него влюбляется такая девушка, о какой он даже не мог мечтать.\n\nНо в одночасье красивый мир вокруг него рушится, и он влипает в крупные неприятности – его обвиняют в ограблении банка, любимая девушка не верит в его невиновность, и в довершении всего его пытаются убить…",
      "tags": [
        "Боевик"
      ],
      "year": 2014,
      "rating": 5.0
    },
    {
      "id": "9s0t1u23-pppp-qqqq-rrrr-abcdefabcdef",
      "name": "Три мушкетера",
      "url": "assets/images/theThreeMusketeers.jpg",
      "description": "История о трех верных мушкетерах, к которым присоединяется новобранец, чтобы защитить короля Франции. Вместе четверка борется против злого кардинала и коварной Миледи.",
      "tags": [
        "Боевик",
        "Приключения"
      ],
      "year": 2023,
      "rating": 2.6
    },
    {
      "id": "9s0t1u23-pppp-qqqq-rrrr-abcdebabfdef",
      "name": "1+1",
      "url": "assets/images/onePlusOne.jpg",
      "description": "Пострадав в результате несчастного случая, богатый аристократ Филипп нанимает в помощники человека, который менее всего подходит для этой работы, – молодого жителя предместья Дрисса, только что освободившегося из тюрьмы. Несмотря на то, что Филипп прикован к инвалидному креслу, Дриссу удается привнести в размеренную жизнь аристократа дух приключений.",
      "tags": [
        "Драма",
        "Комедия"
      ],
      "year": 2011,
      "rating": 8.9
    }
  ]
}

